<?php return array (
    // системные
    'db_err' => 'Ошибка базы данных.',
    'unknown_table' => 'Таблицы с таким именем не существует.',
    'conn_err' => 'Невозможно соединиться с базой данных.',
    'Wrong address.' => 'Неправильный адрес.',
    'No controller file found.' => 'Не найден файл контроллера.',
    'No view file found' => 'Не найден файл отображения.',
    'fieldsRequired' => 'Поля с <span class="error">*</span> обязательны к заполнению.',
    // подписи к кнопкам
	'entrance' => 'вход',
    'login' => 'войти',
    'logout' => 'выйти',
    'search' => 'поиск',
    'save' => 'сохранить',
    'print' => 'распечатать',

    // validation
    'errorsToCorrect' => 'Необходимо исправить следующие ошибки.',
    'fieldRequired' => 'Необходимо заполнить поле.',
    // TODO: переделать
    'alpha' => 'Неправильные символы. Допускаются только буквы.',
    'phone' => 'Телефон должен соответствовать формату: (xxx)xxx-xx-xx.',
    'password' => 'Неправильные символы. Допускаются только буквы латинского алфавита и цифры.',
    'email' => 'Поле не является правильным email адресом.',
    'equals' => 'Значения полей не равны.',
    'unique' => 'Поле не уникально.',
);
